## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/1452265e-1a0b-41bd-bf73-d81db3e4918e/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kv.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "australiaeast"
      + name                            = "kv-biotrackr-prod-ae"
      + public_network_access_enabled   = true
      + resource_group_name             = "rg-biotrackr-prod-ae"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + tenant_id                       = "e60bb76c-8fda-4ed4-a354-4836e3bfcbc3"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.kv.azurerm_key_vault.kv will be created%0A  + resource "azurerm_key_vault" "kv" {%0A      + access_policy                   = (known after apply)%0A      + enable_rbac_authorization       = true%0A      + enabled_for_template_deployment = true%0A      + id                              = (known after apply)%0A      + location                        = "australiaeast"%0A      + name                            = "kv-biotrackr-prod-ae"%0A      + public_network_access_enabled   = true%0A      + resource_group_name             = "rg-biotrackr-prod-ae"%0A      + sku_name                        = "standard"%0A      + soft_delete_retention_days      = 90%0A      + tags                            = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + tenant_id                       = "e60bb76c-8fda-4ed4-a354-4836e3bfcbc3"%0A      + vault_uri                       = (known after apply)%0A%0A      + contact (known after apply)%0A%0A      + network_acls (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>